drowe67/codec2-dev/stm32/src/sm1000_main.c
/*---------------------------------------------------------------------------*\

  FILE........: sm1000_main.c
  AUTHOR......: David Rowe
  DATE CREATED: August 5 2014

  Main program for SM1000.

  TODO

  [ ] make led blink 1-2-3 times for "mode"

\*---------------------------------------------------------------------------*/

/*
  Copyright (C) 2014 David Rowe

  All rights reserved.

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU Lesser General Public License version 2.1, as
  published by the Free Software Foundation.  This program is
  distributed in the hope that it will be useful, but WITHOUT ANY
  WARRANTY; without even the implied warranty of MERCHANTABILITY or
  FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public
  License for more details.

  You should have received a copy of the GNU Lesser General Public License
  along with this program; if not, see <http://www.gnu.org/licenses/>.
*/

#include "stm32f4_adc.h"
#include "stm32f4_dac.h"
#include "freedv_api.h"
#include "codec2_fdmdv.h"
#include "sm1000_leds_switches.h"
#include <stm32f4xx_gpio.h>
#include <stdlib.h>

#include "sfx.h"
#include "sounds.h"
#include "morse.h"
#include "menu.h"

#define FREEDV_NSAMPLES_16K (2*FREEDV_NSAMPLES)

#define MENU_LED_PERIOD  30000
#define ANNOUNCE_DELAY  300000  /* Supposed to be msec, seems not */
#define HOLD_DELAY      100000
#define MENU_DELAY      100000

#define MAX_MODES  3
#define ANALOG     0
#define DV         1
#define TONE       2

struct switch_t sw_select;  /*!< Switch driver for SELECT button */
struct switch_t sw_back;    /*!< Switch driver for BACK button */
struct switch_t sw_ptt;     /*!< Switch driver for PTT buttons */

unsigned int announceTicker = 0;
unsigned int menuLEDTicker = 0;
unsigned int menuTicker = 0;
unsigned int menuExit = 0;

/*!
 * User preferences
 */
static struct prefs_t {
    /*! Operating mode */
    uint8_t op_mode;
    /*! Menu volume (attenuation) */
    uint8_t menu_vol;
    /* TODO: more to come */
} prefs;

struct tone_gen_t tone_gen;
struct sfx_player_t sfx_player;
struct morse_player_t morse_player;

void SysTick_Handler(void);

/*! Menu item root */
static const struct menu_item_t menu_root;

#define MENU_EVT_NEXT   0x10    /*!< Increment the current item */
#define MENU_EVT_PREV   0x11    /*!< Decrement the current item */
#define MENU_EVT_SELECT 0x20    /*!< Select current item */
#define MENU_EVT_BACK   0x21    /*!< Go back one level */
#define MENU_EVT_EXIT   0x30    /*!< Exit menu */

/*!
 * Software-mix two 16-bit samples.
 */
int16_t software_mix(int16_t a, int16_t b) {
    int32_t s = a + b;
    if (s < INT16_MIN)
        return INT16_MIN;   /* Clip! */
    if (s > INT16_MAX)
        return INT16_MAX;   /* Clip! */
    return s;
}

int main(void) {
    struct freedv *f;
    int            nin, nout, i;
    int            n_samples, n_samples_16k;

    /* Menu data */
    struct menu_t   menu;

    /* Outgoing sample counter */
    int spk_nsamples = 0;

    /* init all the drivers for various peripherals */

    SysTick_Config(SystemCoreClock/168000); /* 1 kHz SysTick */
    sm1000_leds_switches_init();
    dac_open(4*DAC_BUF_SZ);
    adc_open(4*ADC_BUF_SZ);
    f = freedv_open(FREEDV_MODE_1600);
    n_samples = freedv_get_n_speech_samples(f);
    n_samples_16k = 2*n_samples;

    short          adc16k[FDMDV_OS_TAPS_16K+n_samples_16k];
    short          dac16k[n_samples_16k];
    short          adc8k[n_samples];
    short          dac8k[FDMDV_OS_TAPS_8K+n_samples];

    /* put outputs into a known state */

    led_pwr(1); led_ptt(0); led_rt(0); led_err(0); not_cptt(1);

    /* clear filter memories */

    for(i=0; i<FDMDV_OS_TAPS_16K; i++)
        adc16k[i] = 0.0;
    for(i=0; i<FDMDV_OS_TAPS_8K; i++)
        dac8k[i] = 0.0;

    /* Clear out switch states */
    memset(&sw_select, 0, sizeof(sw_select));
    memset(&sw_back, 0, sizeof(sw_back));
    memset(&sw_ptt, 0, sizeof(sw_ptt));

    /* Clear out menu state */
    memset(&menu, 0, sizeof(menu));

    morse_player.freq = 800;
    morse_player.dit_time = 60;    /* 20 WPM */
    morse_player.msg = NULL;

    tone_reset(&tone_gen, 0, 0);

    /* play a start-up tune. */
    sfx_play(&sfx_player, sound_startup);

    prefs.op_mode = ANALOG;
    prefs.menu_vol = 2;

    while(1) {
        /* Read switch states */
        switch_update(&sw_select,   (!switch_select()) ? 1 : 0);
        switch_update(&sw_back,     (!switch_back()) ? 1 : 0);
        switch_update(&sw_ptt,      (switch_ptt() ||
                                        (!ext_ptt())) ? 1 : 0);

        /* Process menu */
        if (!menuTicker) {
            if (menu.stack_depth > 0) {
                /* We are in a menu */
                static uint8_t press_ack = 0;

                if (press_ack == 1) {
                    if ((sw_select.state == SW_STEADY)
                            && (!sw_select.sw))
                        press_ack = 0;
                } else if (press_ack == 2) {
                    if ((sw_back.state == SW_STEADY)
                            && (!sw_back.sw))
                        press_ack = 0;
                } else {
                    if (switch_pressed(&sw_select) > HOLD_DELAY) {
                        menu_exec(&menu, MENU_EVT_SELECT);
                        press_ack = 1;
                        menuTicker = MENU_DELAY;
                    } else if (switch_pressed(&sw_back) > HOLD_DELAY) {
                        menu_exec(&menu, MENU_EVT_BACK);
                        press_ack = 2;
                        menuTicker = MENU_DELAY;
                    } else if (switch_released(&sw_select)) {
                        menu_exec(&menu, MENU_EVT_NEXT);
                        menuTicker = MENU_DELAY;
                    } else if (switch_released(&sw_back)) {
                        menu_exec(&menu, MENU_EVT_PREV);
                        menuTicker = MENU_DELAY;
                    } else if (switch_released(&sw_ptt)) {
                        while(menu.stack_depth > 0)
                            menu_exec(&menu, MENU_EVT_EXIT);
                        sfx_play(&sfx_player, sound_returned);
                    }

                    /* If exited, put the LED back */
                    if (!menu.stack_depth) {
                        menuLEDTicker = 0;
                        menuTicker = 0;
                        led_pwr(LED_ON);
                        morse_play(&morse_player, NULL);
                        menuExit = 1;
                    }
                }
            } else {
                uint8_t mode_changed = 0;

                if (menuExit) {
                    /* We've just exited a menu, wait for release of BACK */
                    if (switch_released(&sw_back))
                        menuExit = 0;
                } else if (switch_pressed(&sw_select) > HOLD_DELAY) {
                    /* Enter the menu */
                    menu_enter(&menu, &menu_root);
                    menuTicker = MENU_DELAY;
                } else if (switch_released(&sw_select)) {
                    /* Shortcut: change current mode */
                    prefs.op_mode = (prefs.op_mode + 1) % MAX_MODES;
                    mode_changed = 1;
                } else if (switch_released(&sw_back)) {
                    /* Shortcut: change current mode */
                    prefs.op_mode = (prefs.op_mode - 1) % MAX_MODES;
                    mode_changed = 1;
                }

                if (mode_changed) {
                    /* Announce the new mode */
                    if (prefs.op_mode == ANALOG)
                        morse_play(&morse_player, "ANA");
                    else if (prefs.op_mode == DV)
                        morse_play(&morse_player, "1600");
                    else if (prefs.op_mode == TONE)
                        morse_play(&morse_player, "TONE");
                    sfx_play(&sfx_player, sound_click);
                }
            }
        }

        /* Acknowledge switch events */
        switch_ack(&sw_select);
        switch_ack(&sw_back);
        switch_ack(&sw_ptt);

